Revit 2026 API

# SATImportOptions(SATImportOptions) Constructor

---

Constructs a new instance of SATImportOptions as a copy of the import options.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SATImportOptions(
	SATImportOptions option
)
```
```vb
Public Sub New (
	option As SATImportOptions
)
```
```cpp
public:
SATImportOptions(
	SATImportOptions^ option
)
```
```fsharp
new :
        option : SATImportOptions -> SATImportOptions
```

#### Parameters

option SATImportOptions
     The SAT options to be copied.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

SATImportOptions Class

SATImportOptions Overload

Autodesk.Revit.DB Namespace